import os
from logger_config import logger

# =====================================================================

BOT_TOKEN = os.getenv('TELEGRAM_BOT_TOKEN', 'token')

WAIT_MESSAGE =  "🔍 در حال تحلیل بازار برای یافتن بهترین فرصت معاملاتی\n" + \
                "⏳ این کار ممکن است چند دقیقه طول بکشد"
        
WAIT_TOO_LONG_MESSAGE = "⏳ تحلیل بیش از حد طول کشید. لطفاً دوباره تلاش کنید."

BEST_OPPORTUNITY_MESSAGE = "🎯 *بهترین فرصت معاملاتی یافت شده*\n" + f"{'='*10}\n\n"


TECHNICAL_ANALYZE = "📈 **تحلیل تکنیکال پیشرفته:**\n"

OVER_BUY = "🔴 (خرید بیش از حد)"

OVER_SELL = "🟢 (فروش بیش از حد)"

STRONG_OUTFLOW = "🟢 (جریان پول خروجی قوی)"
STRONG_INFLOW = "🔴 (جریان پول ورودی قوی)"

HIGH_VOLUME = "🟢 (حجم بالا)"
MEDIUM_VOLUME = "🟡 (حجم متوسط)"
LOW_VOLUME = "🔴 (حجم پایین)"

BALANCED = "🟡 (متعادل)"
NATURAL_ZONE = "🟡 (محدوده طبیعی)"

ASCENDING = "⬆️ (صعودی)"
DESCENDING = "⬇️ (نزولی)"
NO_TREND = "⚪️ (بدون جهت)"

NEAR_FIBONACCI_LEVELS = "\n🎯 **سطوح فیبوناچی نزدیک:**\n"

SIGNAL_POINTS = "\n🎯 **امتیاز سیگنال‌ها:**\n"

NO_SIGNAL_FOUND = "❌ متأسفانه در حال حاضر هیچ سیگنال معاملاتی با دقت بالا یافت نشد.\n\n" + \
                "🔍 **دلایل احتمالی:**\n" + \
                "• بازار در حالت تثبیت قرار دارد\n" + \
                "• شرایط تکنیکال مناسب معاملاتی وجود ندارد\n" + \
                "• همه سیگنال‌ها دارای ریسک بالا هستند\n\n" + \
                "💡 **پیشنهاد:**\n" + \
                "• 30-60 دقیقه دیگر مجدداً تلاش کنید\n" + \
                "• در انتظار شکل‌گیری الگوهای تکنیکال باشید\n" + \
                "• از معاملات پر ریسک خودداری کنید\n\n" + \
                "🔄 برای تحلیل مجدد /start را ارسال کنید."

ERROR_MESSAGE = "❌ خطایی در تحلیل بازار رخ داد. لطفا دوباره تلاش کنید.\n"

# =====================================================================




# رنگ‌های تلگرام
TELEGRAM_COLORS = {
    "BUY": "🟢",
    "SELL": "🔴",
    "STRONG_BUY": "💚",
    "STRONG_SELL": "❤️",
    "HOLD": "🟡",
    "WARNING": "⚠️",
    "INFO": "ℹ️",
    "SUCCESS": "✅",
    "ERROR": "❌"
}